Revit 2025 API
DistributionType Enumeration
Note: This API is now obsolete.
 The type of the distribution
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
[ObsoleteAttribute("<p> This Enum is deprecated in Revit 2025 and may be removed in a later version of Revit. It is the value of the Autodesk.Revit.DB.Structure.Rebar.DistributionType property. This property was also deprecated and Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars can be used instead.</p> <p>To check if the set can have (but not necessary have) varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.CanHaveVaryingLengthBars. To check if the set has varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.HasVaryingLengthBars.</p>")]
public enum DistributionType
<ObsoleteAttribute("<p> This Enum is deprecated in Revit 2025 and may be removed in a later version of Revit. It is the value of the Autodesk.Revit.DB.Structure.Rebar.DistributionType property. This property was also deprecated and Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars can be used instead.</p> <p>To check if the set can have (but not necessary have) varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.CanHaveVaryingLengthBars. To check if the set has varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.HasVaryingLengthBars.</p>")>
Public Enumeration DistributionType
[ObsoleteAttribute(L"<p> This Enum is deprecated in Revit 2025 and may be removed in a later version of Revit. It is the value of the Autodesk.Revit.DB.Structure.Rebar.DistributionType property. This property was also deprecated and Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars can be used instead.</p> <p>To check if the set can have (but not necessary have) varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.CanHaveVaryingLengthBars. To check if the set has varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.HasVaryingLengthBars.</p>")]
public enum class DistributionType
[<ObsoleteAttribute("<p> This Enum is deprecated in Revit 2025 and may be removed in a later version of Revit. It is the value of the Autodesk.Revit.DB.Structure.Rebar.DistributionType property. This property was also deprecated and Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars can be used instead.</p> <p>To check if the set can have (but not necessary have) varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.CanHaveVaryingLengthBars. To check if the set has varying length bars you can use Autodesk.Revit.DB.Structure.Rebar.HasVaryingLengthBars.</p>")>]
type DistributionType
Members
Member name | Value | Description
Uniform | 0 |  It is an uniform distribution.
VaryingLength | 1 |  It is a varying length distribution.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace